Config/AccumulationRegisters/LabeledGoods.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>LabeledGoods</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Sum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>VATSum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>MarkingCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Service</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Services</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Folio</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Folio</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/AccumulationRegisters/LabeledGoods/Ext/ManagerModule.bsl
#Region Public
 
 // --------------------------------------------------------------------------------
 //  Function - Labeled good paid
 //
 // Parameters:
 //  pMarkingCode - String						 - Marking code
 //  pHotel		 - CatalogRef.Hotels			 - Hotel ref
 //  pDateTo		 - Date							 - Date
 //  pService	 - CatalogRef.Services, Undefined - ref
 // 
 // Returns:
 //  Boolean - True or False, was paid
 //
 Function LabeledGoodPaid(pMarkingCode, pHotel, pDateTo = Undefined, pService = Undefined) Export 
	 
	 vQuery = New Query;
	 vQuery.Text = 
	 "SELECT
	 |	LabeledGoodsBalance.MarkingCode AS MarkingCode,
	 |	LabeledGoodsBalance.Service AS Service,
	 |	LabeledGoodsBalance.Folio AS Folio,
	 |	LabeledGoodsBalance.SumBalance AS SumBalance,
	 |	LabeledGoodsBalance.QuantityBalance AS QuantityBalance
	 |FROM
	 |	AccumulationRegister.LabeledGoods.Balance(
	 |			&qDateTo,
	 |			(&qServiceNotFilled
	 |				OR NOT &qServiceNotFilled
	 |					AND Service = &qService)
	 |				AND MarkingCode = &qMarkingCode
	 |				AND Folio.Hotel = &qHotel) AS LabeledGoodsBalance";
	 
	 vQuery.SetParameter("qDateTo", pDateTo);
	 vQuery.SetParameter("qMarkingCode", pMarkingCode);
	 vQuery.SetParameter("qHotel", pHotel); 
	 vQuery.SetParameter("qService", pService);
	 vQuery.SetParameter("qServiceNotFilled", Not ValueIsFilled(pService));
	 
	 vQueryResult = vQuery.Execute();
	 
	 Return vQueryResult.IsEmpty()
 EndFunction
 
// --------------------------------------------------------------------------------
//
// Parameters:
//  pData			 - DataRow	 - Data
//  pReceiverNode	 - Node		 - Receiver node
//
Procedure ExchangePlansRecordChanges(pData, pReceiverNode = Undefined) Export
	 // NOTHING SO FAR	
 EndProcedure // ExchangePlansRecordChanges
 
 #EndRegion
